Tekla.Structures.Model.RebarLengthAdjustmentDataNullable
The RebarLengthAdjustmentDataNullable class defines the length adjustment at the end of a reinforcing bar affected by a Tekla.Structures.Model.RebarEndDetailModifier.
If a length adjustment property is null then that property will not be applied to the Tekla.Structures.Model.RebarSet generated reinforcing bars.

Tekla.Structures.Model.RebarLengthAdjustmentDataNullable.#ctor
Initializes a new instance of the Tekla.Structures.Model.RebarLengthAdjustmentDataNullable class.

Tekla.Structures.Model.RebarLengthAdjustmentDataNullable.AdjustmentType
Gets or sets the adjustment type.

Tekla.Structures.Model.RebarLengthAdjustmentDataNullable.AdjustmentLength
Gets or sets the adjustment length.

Tekla.Structures.Model.RebarLengthAdjustmentDataNullable.ToStruct(Tekla.Structures.ModelInternal.dotRebarLengthAdjustment_t@)
The to struct method.
dotLengthAdjustment: The rebar length adjustment struct.

Tekla.Structures.Model.RebarLengthAdjustmentDataNullable.FromStruct(Tekla.Structures.ModelInternal.dotRebarLengthAdjustment_t@)
The from struct method.
dotLengthAdjustment: The rebar length adjustment struct.